{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[MASK]": 2,
      "T": 21,
      "V": 24,
      "Q": 10,
      "1": 25,
      "S": 20,
      "D": 6,
      "C": 8,
      "E": 9,
      "M": 17,
      "W": 22,
      "[UNK]": 0,
      "3": 27,
      "Y": 23,
      "[PAD]": 1,
      "B": 7,
      "K": 16,
      "2": 26,
      "F": 18,
      "I": 14,
      "Z": 11,
      "L": 15,
      "P": 19,
      "G": 12,
      "H": 13,
      "N": 5,
      "R": 4,
      "A": 3
    },
    "merges": []
  }
}